OpenFOAM-13/tutorials/incompressibleVoF/trayedPipe/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    bottom
    {
        type            prghCyclicPressure;
        patchType       cyclic;
        rhoInf          1;
    }
    top
    {
        type            prghCyclicPressure;
        patchType       cyclic;
    }
}


// ************************************************************************* //
